<article class="article"><p class="lead"> В этой статье я планирую рассказать как на своей практике мы применяем
        диаграмму сгорания (Burn Down Chart) в процессе работы по фреймворку SAFe </p>

    <p>Начну, пожалуй с самого интересного. А именно с того, что использование этой диаграммы на моем опыте в SAFe не
        имеет никакой специфики относительно использования этой диаграммы в SCRUM.</p>

    <blockquote class="bg-primary-alt">
        <div class="h3 mb-2">“Использование этой диаграммы на моем опыте в SAFe не
            имеет никакой специфики относительно использования этой диаграммы в SCRUM.”</div>
        <span class="text-small text-muted">– Я</span>
        <a href="#" class="btn btn-primary btn-sm">
            <img class="icon" src="" alt="twitter social icon" data-inject-svg="">
            <span>Tweet</span>
        </a>
    </blockquote>


    <p> Немного расскажу мы - это кто. У нас команда, состоящая из 9 человек (Product Owner - 1 шт., Scrum Master - 1
        шт., Dev-team - 7 человек (из которых 3 разработчика, 2 аналитика и 2 тестировщика). Роли внутри dev-team я
        указал как основную специализацию, но это не значит что тестировщик не может подстраховать аналитика и наоборот
        плюс разработчики тоже с разным стеком и также могут подстраховать друг друга. </p>
    <p> В своей работе мы используем фреймворк <a href="https://www.scaledagileframework.com">SAFe или Scaled Agile
            Framework</a>. Я постараюсь описать очень кратко и для тех, кто более-менее представляет что-то об Agile
        такого описания должно быть достаточно. </p>                         <h4>SAFe или Scaled Agile Framework</h4>
    <p> По сути - это работа по методологии Scrum или Kanban в крупной корпорации (не в такой, где одна команда фигачит
        стартап сутки напролет), где могут совместно работать много скрам-команд (у нас их 17). </p>
    <h4>Диаграммы сгорания (Burn Down Charts)</h4>
    <p> Как ни сранно, внутри спринта при использовании "Диаграмм Сгорания" (Burn Down Charts), разницы особой нет SAFe
        у вас или стартап из одной команды. </p>
    <p>По сути мы просто визуализируем общий объем работ на спринт, понимаем тенденцию и, таким образом, понимаем на
        сколько качественно мы спланировали спринт. Этот инструмент не единственный, но он существенно облегчает работу
        в долгой перспективе.</p>
    <p>Конечно, всем интересно, как на практике данная диаграмма помогает в решении командных проблем. Я лишь постараюсь
        перечислить несколько кейсов, уверен, что у многих бывали и другие, буду рад дополнениям в комментариях.</p>
    <h4>Контекст</h4>
    <p>Также хочу заранее договориться о том, что мы все кейсы рассматриваем при условии, что команда ежедневно перед
        стендапом обращает внимание на эту диаграмму. Способы могут быть разные (у нас, например, Scrum Master публикует
        ежедневно перед стендапом актуальную версию в командном чате с упоминанием всей команды.</p>
    <h4>Своевременное понимание всей команды, что появилась незапланированная работа</h4>
    <p>Например, давйте представим, что в командном чате вы каждый день выкладываете текущий тип диаграммы. У нас
        происходило такое, что один из членов команды заводил историю, сам ее оценивал и закидывал на доску. Как ни
        странно такое бывает и у достаточно развитых команд с точки зрения Agile. Почему-то этот разработчик не учитывал
        тот факт, что оценка должна быть командной и вся команда должна принимать такое решение на одном из мероприятий
        (если внутри не договорились иначе.</p>
    <p>В итоге, при следующем апдейте(максимум через 8 рабочих часов, вся команда видит, что добавилась работа, и на
        стендапе может обсудить этот инцидент и как с ним поступить</p>
    <p>Спасает это прежде всего от невнятных комментариев на ретроспективе о том почему мы завалили спринт. Помимо
        этого, повышает степень командной, а не персональной ответственности.</p>                          <h4>
        Индексация опыта и инструмент улучшения качества планирования</h4>
    <p>Когда команда постоянно наблюдает за данной диаграммой, постепенно набиратется опыт и мы уже заранее знаем какие
        проблемы в команде как на нее влияют. Например, мы можем понять, что если плохо декомпозировать задачи, то
        сжигание происходт в лучшем случае в последний момент и очень часто в результате такого "сжигания" заводятся
        новые истории в беклог, которые на самом деле просто позволяют думать, что мы завершили спринт успешно. Скрам
        Мастер, конечно, должен пресекать подобное.</p>                          <h4>Помогает понять перед стендапом и
        на ретроспективе на сколько мы отклоняемся от идеального сгорания и своевременно задуматься о каких-либо
        действиях</h4>
    <p>Когда команда постоянно наблюдает за данной диаграммой, постепенно набиратется опыт и мы уже заранее знаем какие
        проблемы в команде как на нее влияют. Например, мы можем понять, что если плохо декомпозировать задачи, то
        сжигание происходт в лучшем случае в последний момент и очень часто в результате такого "сжигания" заводятся
        новые истории в беклог, которые на самом деле просто позволяют думать, что мы завершили спринт успешно. Скрам
        Мастер, конечно, должен пресекать подобное.</p>                          <h4>Пример не очень хорошей
        диаграмы</h4>
    <p>Когда команда постоянно наблюдает за данной диаграммой, постепенно набиратется опыт и мы уже заранее знаем какие
        проблемы в команде как на нее влияют. Например, мы можем понять, что если плохо декомпозировать задачи, то
        сжигание происходт в лучшем случае в последний момент и очень часто в результате такого "сжигания" заводятся
        новые истории в беклог, которые на самом деле просто позволяют думать, что мы завершили спринт успешно. Скрам
        Мастер, конечно, должен пресекать подобное.</p></article>